### TF COMMANDS ###
### $ leverage tf init ###

```
[12:34:42]    INFO Attempting to get temporary credentials for apps-devstg account.
[12:34:44]    INFO Using already configured temporary credentials.
[12:34:44]    INFO Attempting to get temporary credentials for shared account.
[12:34:46]    INFO Using already configured temporary credentials.

Acquiring state lock. This may take a few moments...
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.basic_instance[0] will be created
  + resource "aws_iam_instance_profile" "basic_instance" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "basic-instance-profile-fleet-ansible-ssm-demo"
      + path        = "/"
      + role        = "basic-instance-role-fleet-ansible-ssm-demo"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.basic_instance_assume_role[0] will be created
  + resource "aws_iam_role" "basic_instance_assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "basic-instance-role-fleet-ansible-ssm-demo"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ec2_ssm_access[0] will be created
  + resource "aws_iam_role_policy_attachment" "ec2_ssm_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "basic-instance-role-fleet-ansible-ssm-demo"
    }

  # module.ec2_ansible_fleet["1"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0b0ea68c435eb488d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "basic-instance-profile-fleet-ansible-ssm-demo"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "apps-devstg-default"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-05d75XXXXXXX35e5"
      + tags                                 = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-1"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-1"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "ec2-ansible-fleet-1"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.ec2_ansible_fleet["2"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0b0ea68c435eb488d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "basic-instance-profile-fleet-ansible-ssm-demo"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "apps-devstg-default"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-094c28XXXXXX7180"
      + tags                                 = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-2"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-2"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "ec2-ansible-fleet-2"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.ec2_ansible_fleet["3"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0b0ea68c435eb488d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "basic-instance-profile-fleet-ansible-ssm-demo"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "apps-devstg-default"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0d218XXXXXX8fcddd"
      + tags                                 = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-3"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-3"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "ec2-ansible-fleet-3"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.ec2_ansible_fleet["4"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0b0ea68c435eb488d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "basic-instance-profile-fleet-ansible-ssm-demo"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "apps-devstg-default"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-021c48XXXXXX6a9"
      + tags                                 = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-4"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-4"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "ec2-ansible-fleet-4"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.security_group_ec2_fleet.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for example usage with EC2 instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ec2-ansible-fleet-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ec2-ansible-fleet"
        }
      + tags_all               = {
          + "Name" = "ec2-ansible-fleet"
        }
      + vpc_id                 = "vpc-07XXXXXXXXXX95"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group_ec2_fleet.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.security_group_ec2_fleet.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "172.XXX.XXX.0/20",
          + "172.XXX.XXX.0/20",
        ]
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.security_group_ec2_fleet.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "172.XXX.XXX.0/20",
          + "172.XXX.XXX.0/20",
        ]
      + description              = "All IPV4 ICMP"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_ids = {
      + "1" = (known after apply)
      + "2" = (known after apply)
      + "3" = (known after apply)
      + "4" = (known after apply)
    }
  + private_dns  = {
      + "1" = (known after apply)
      + "2" = (known after apply)
      + "3" = (known after apply)
      + "4" = (known after apply)
    }
  + private_ip   = {
      + "1" = (known after apply)
      + "2" = (known after apply)
      + "3" = (known after apply)
      + "4" = (known after apply)
    }
  + public_dns   = {
      + "1" = (known after apply)
      + "2" = (known after apply)
      + "3" = (known after apply)
      + "4" = (known after apply)
    }
  + tags_all     = {
      + "1" = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-1"
          + "Terraform"   = "true"
        }
      + "2" = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-2"
          + "Terraform"   = "true"
        }
      + "3" = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-3"
          + "Terraform"   = "true"
        }
      + "4" = {
          + "Environment" = "apps-devstg"
          + "Name"        = "ec2-ansible-fleet-4"
          + "Terraform"   = "true"
        }
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_role.basic_instance_assume_role[0]: Creating...
module.security_group_ec2_fleet.aws_security_group.this_name_prefix[0]: Creating...
aws_iam_role.basic_instance_assume_role[0]: Creation complete after 3s [id=basic-instance-role-fleet-ansible-ssm-demo]
aws_iam_role_policy_attachment.ec2_ssm_access[0]: Creating...
aws_iam_instance_profile.basic_instance[0]: Creating...
aws_iam_role_policy_attachment.ec2_ssm_access[0]: Creation complete after 0s [id=basic-instance-role-fleet-ansible-ssm-demo-20220625123746845000000002]
module.security_group_ec2_fleet.aws_security_group.this_name_prefix[0]: Creation complete after 4s [id=sg-0ab3XXXXXX291]
aws_iam_instance_profile.basic_instance[0]: Creation complete after 1s [id=basic-instance-profile-fleet-ansible-ssm-demo]
module.security_group_ec2_fleet.aws_security_group_rule.egress_rules[0]: Creating...
module.security_group_ec2_fleet.aws_security_group_rule.ingress_rules[1]: Creating...
module.ec2_ansible_fleet["4"].aws_instance.this[0]: Creating...
module.security_group_ec2_fleet.aws_security_group_rule.ingress_rules[0]: Creating...
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Creating...
module.ec2_ansible_fleet["3"].aws_instance.this[0]: Creating...
module.ec2_ansible_fleet["2"].aws_instance.this[0]: Creating...
module.security_group_ec2_fleet.aws_security_group_rule.ingress_rules[1]: Creation complete after 2s [id=sgrule-3382018181]
module.security_group_ec2_fleet.aws_security_group_rule.egress_rules[0]: Creation complete after 3s [id=sgrule-1729293246]
module.security_group_ec2_fleet.aws_security_group_rule.ingress_rules[0]: Creation complete after 4s [id=sgrule-1619376181]
module.ec2_ansible_fleet["4"].aws_instance.this[0]: Still creating... [10s elapsed]
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Still creating... [10s elapsed]
module.ec2_ansible_fleet["3"].aws_instance.this[0]: Still creating... [10s elapsed]
module.ec2_ansible_fleet["2"].aws_instance.this[0]: Still creating... [10s elapsed]
module.ec2_ansible_fleet["4"].aws_instance.this[0]: Still creating... [20s elapsed]
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Still creating... [20s elapsed]
module.ec2_ansible_fleet["3"].aws_instance.this[0]: Still creating... [20s elapsed]
module.ec2_ansible_fleet["2"].aws_instance.this[0]: Still creating... [20s elapsed]
module.ec2_ansible_fleet["4"].aws_instance.this[0]: Still creating... [30s elapsed]
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Still creating... [30s elapsed]
module.ec2_ansible_fleet["3"].aws_instance.this[0]: Still creating... [30s elapsed]
module.ec2_ansible_fleet["2"].aws_instance.this[0]: Still creating... [30s elapsed]
module.ec2_ansible_fleet["3"].aws_instance.this[0]: Creation complete after 33s [id=i-0a853bd639283e691]
module.ec2_ansible_fleet["4"].aws_instance.this[0]: Still creating... [40s elapsed]
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Still creating... [40s elapsed]
module.ec2_ansible_fleet["2"].aws_instance.this[0]: Still creating... [40s elapsed]
module.ec2_ansible_fleet["2"].aws_instance.this[0]: Creation complete after 43s [id=i-04b74e61e749eafee]
module.ec2_ansible_fleet["4"].aws_instance.this[0]: Still creating... [50s elapsed]
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Still creating... [50s elapsed]
module.ec2_ansible_fleet["4"].aws_instance.this[0]: Creation complete after 54s [id=i-06d1162a471ae2910]
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Still creating... [1m0s elapsed]
module.ec2_ansible_fleet["1"].aws_instance.this[0]: Creation complete after 1m3s [id=i-01ff24db0a1046501]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 11 added, 0 changed, 0 destroyed.

Outputs:

instance_ids = {
  "1" = "i-01ff24db0a1046501"
  "2" = "i-04b74e61e749eafee"
  "3" = "i-0a853bd639283e691"
  "4" = "i-06d1162a471ae2910"
}
private_dns = {
  "1" = "ip-172-18-32-87.ec2.internal"
  "2" = "ip-172-18-34-86.ec2.internal"
  "3" = "ip-172-18-41-66.ec2.internal"
  "4" = "ip-172-18-42-180.ec2.internal"
}
private_ip = {
  "1" = "172.18.32.87"
  "2" = "172.18.34.86"
  "3" = "172.18.41.66"
  "4" = "172.18.42.180"
}
public_dns = {
  "1" = ""
  "2" = ""
  "3" = "ec2-44-200-5-207.compute-1.amazonaws.com"
  "4" = "ec2-54-89-217-250.compute-1.amazonaws.com"
}
tags_all = {
  "1" = tomap({
    "Environment" = "apps-devstg"
    "Name" = "ec2-ansible-fleet-1"
    "Terraform" = "true"
  })
  "2" = tomap({
    "Environment" = "apps-devstg"
    "Name" = "ec2-ansible-fleet-2"
    "Terraform" = "true"
  })
  "3" = tomap({
    "Environment" = "apps-devstg"
    "Name" = "ec2-ansible-fleet-3"
    "Terraform" = "true"
  })
  "4" = tomap({
    "Environment" = "apps-devstg"
    "Name" = "ec2-ansible-fleet-4"
    "Terraform" = "true"
  })
}
```